Repository: DenDmitriev/GrabShot
Catalog: GrabShot/*.lproj/Localizable.strings
Languages: ru

source: Overview
ru: Обзор

source: Next
ru: Далее

source: Get started
ru: Начать

source: About application GrabShot
ru: О приложении GrabShot

source: Import Videos
ru: Импорт видео

source: Import Images
ru: Импорт изображений

source: Version
ru: Версия

source: shots
ru: кадр(ов)

source: grabbed from
ru: захвачено c

source: Show Overview
ru: Показать обзор

source: Show in Finder
ru: Показать в Finder

source: Show export directory
ru: Показать папку экспорта

source: Show GrabShot
ru: Показать GrabShot

source: Show overview
ru: Показать обзор

source: Quit
ru: Завершить

source: Drop Video
ru: Бросить видео

source: Grab Queue
ru: Очередь Захвата

source: Image Strip
ru: Цвета изображения

source: Open settings
ru: Открыть настройки

source: Drag&Drop video
ru: Импорт видео

source: Video grab
ru: Захват видео

source: Image colors
ru: Цвета изображения

# Drag&Drop
source: Drag and drop the video files to the window
ru: Перетащите видео файлы в окно

# Drag&Drop Images
source: Drag and drop the image files to the window
ru: Перетащите изображения в окно

source: Start
ru: Старт

source: Period
ru: Период

source: seconds
ru: секунд

source: Grab
ru: Захват

source: Strip
ru: Штрих код

source: Pause
ru: Пауза

source: Cancel
ru: Отмена

source: shots grabbed
ru: кадра(ов) захвачено

source: from
ru: из

source: Custom range settings for video grabbing
ru: Настройки пользовательского диапазона для захвата видео

source: Range grabbing
ru: Захват диапазона

source: From
ru: От

source: To
ru: До

source: Full
ru: Весь

source: Excerpt
ru: Отрывок

source: Range
ru: Диапазон

source: Ready
ru: Готов

source: Calculating
ru: Расчёт

source: Grabbing...
ru: Захват...

source: Resume
ru: Продолжить

source: Canceled
ru: Отменено

source: Complete
ru: Готово

source: Done
ru: Готово

source: Title
ru: Название

source: Source
ru: Источник

source: Path
ru: Путь

source: Output
ru: Вывод

source: Duration
ru: Длина

source: Shots
ru: Кадров

source: Progress
ru: Прогресс

source: Choose export directory
ru: Выбрать папку экспорта

source: for
ru: на

# frames
source: f
ru: к

source: Show source file in Finder
ru: Показать исходный файл в Finder

source: Switch video to grab
ru: Переключить видео, чтобы захватить

source: Choose export folder
ru: Выбрать папку экспорта

source: Duration video
ru: Продолжительность видео

source: Number of grabbing frames
ru: Количество кадров захвата

source: Select grabbing range
ru: Выбрать диапазон захвата

source: Select menu
ru: Выберите меню

source: Quality
ru: Качество

source: Grab shots compression ratio
ru: Коэффициент сжатия захваченных кадров

source: Open folder
ru: Открыть папку

source: Open folder with shots after capture
ru: Открыть папку после захвата

source: Grab settings
ru: Настройки захвата

source: Settings
ru: Настройки

source: Create strip
ru: Создать штрих код

source: Save image to grab folder
ru: Сохранить штрих код в папку захвата

source: Number of average colors
ru: Количество средних цветов

source: Sampling average colors from one grabbed frame
ru: Выборка средних цветов из одного захваченного кадра

source: Strip resolution
ru: Разрешение штрих кода

source: Image size for video color strip
ru: Размер изображения для штрих кода видео

source: Strip settings for video
ru: Настройки штрих-кода для видео

source: px
ru: пикс

source: Barcode height
ru: Высота штрих-кода

source: The barcode will be extended at the bottom of the image
ru: Штрих-код будет расширен внизу изображения

source: Height strip
ru: Полоска высоты

source: Number of colors
ru: Количество цветов

source: Sampling average colors from an image
ru: Выборка средних цветов из изображения

source: Strip settings for image
ru: Настройки штрих-кода для изображения

source: colors
ru: цветов

source: Unknown error
ru: Неизвестная ошибка

source: Unknown reaction
ru: Неизвестная реакция

source: Something went wrong
ru: Что-то пошло не так

source: Try again
ru: Попробуйте еще раз

source: file type does not match the requirement
ru: тип файла не соответствует требованиям

source: Use files with extension
ru: Используйте файлы с расширением

source: Can't get duration of video by path
ru: Не удается получить продолжительность для видео по расположению

source: Can't grab shot in
ru: Не получается сделать скриншот

source: Ok
ru: Oк

source: Can't get write access to export folder
ru: Не удается получить доступ записи в папке экспорта

source: Try restarting the app
ru: Попробуйте перезапустить приложение

source: No export folder selected for
ru: Не выбрана папка экспорта

source: Select the export folder for the video again
ru: Выберите папку экспорта для видео снова

source: Can't get export directory
ru: Не удается получить папку экспорта

source: Congratulations!
ru: Поздравляем!

source: Would you like to donate to the developer for coffee ☕️ right now?
ru: Хотите пожертвовать разработчику на кофе ☕️ прямо сейчас?

source: You have grabbed %d shots of video.
ru: Вы захватили %d кадра(ов) видео.

source: Donate 🍪
ru: Подарить 🍪

source: Export
ru: Экспорт

source: Fill
ru: Заполнить

source: Fit
ru: Вписать

source: Color difference
ru: Разница в цвете

source: Color extraction
ru: Выделение цвета

source: Method
ru: Метод

source: Algorithm
ru: Алгоритм

source: Flags
ru: Флаги

source: Additional options
ru: Дополнительные опции

source: Exclude black color
ru: Исключить черный цвет

source: Exclude white color
ru: Исключить белый цвет

source: Select custom color
ru: Выбрать цвет вручную

source: Choose an image
ru: Выберите изображение

source: Export all
ru: Экспорт всех

source: Export selected
ru: Экспорт выделенных

source: Clear
ru: Очистить

source: Euclidean
ru: Евклидов

source: Average Color
ru: Средний цвет

source: Area average color
ru: Средний цвет по сегментам

source: Domination colors
ru: Доминирующие цвета

source: Finds the dominant colors of an image by using using a k-means clustering algorithm.
ru: Находит доминирующие цвета изображения с помощью алгоритма кластеризации k-средних.

source: Finds the dominant colors of an image by using using a area average algorithm.
ru: Находит доминирующие цвета изображения, используя алгоритм усреднения по площади.

source: Finds the dominant colors of an image by iterating, grouping and sorting its pixels and using the difference between the colors.
ru: Находит доминирующие цвета изображения путем повторения, группировки и сортировки пикселей и использования разницы между цветами.

source: Computes the Euclidean distance in RGB color space.
ru: Вычисляет евклидово расстояние в цветовом пространстве RGB.

source: CIE76 algorithm calculates difference in Lab color space.
ru: Алгоритм CIE76 вычисляет разницу в цветовом пространстве Lab.

source: The CIE94 algorithm is an improvement of CIE76, it calculates the difference in the Lab color space. Slightly slower than CIE76.
ru: Алгоритм CIE94 является улучшением CIE76, вычисляет разницу в цветовом пространстве Lab. Немного медленнее, чем CIE76.

source: The CIEDE2000 algorithm is the most accurate color comparison algorithm in the Lab color space. It is significantly slower than its predecessors.
ru: Алгоритм CIEDE2000 — наиболее точный алгоритм сравнения цветов в цветовом пространстве Lab. Он значительно медленнее своих предшественников.

source: The CMC algorithm calculates the difference in the LHS (Luminance, Chroma, Hue) color space.
ru: Алгоритм CMC вычисляет разницу в цветовом пространстве LHS (яркость, цветность, оттенок).

source: Welcome to GrabShot
ru: Добро пожаловать в GrabShot

source: An application for capturing frames from videos and extracting colors
ru: Приложение для захвата кадров из видео и извлечения цвета

source: To get acquainted with the main functions of the application, click next or close the window
ru: Чтобы ознакомиться с основными функциями приложения нажмите кнопку далее или закройте окно

source: Control panel
ru: Панель управления

source: There are workspaces in the application
ru: В приложении есть рабочие области

source: To select a workspace, use the tab navigation bar
ru: Для выбора рабочего пространства используйте панель навигации по вкладкам

source: To change the application settings, click on the gear
ru: Для изменения настроек приложения нажмите на шестеренку

source: Video import
ru: Импорт видео

source: To get started with the video, import the files. There are several options for this:
ru: Чтобы начать работу с видео, импортируйте файлы. Для этого есть несколько вариантов:

source: Drag and drop files to the Drop video tab
ru: Перетащите файлы на вкладку бросить видео

source: Drag and drop files to the Grab queue tab
ru: Перетащите файлы на вкладку очередь захвата

source: Import files via the application menu
ru: Импорт файлов через меню приложения

source: Frame grabbing
ru: Захват кадров

source: After importing the video, you are taken to the capture queue tab
ru: После импорта видео вы попадаете на вкладку очередь захвата

source: The window consists of a table of imported videos. The first step is to select the export folder. Next, decide on the assortment, you can choose an excerpt or the whole. Specify the frame capture interval in seconds. Finally, click the Start button and manage the process.
ru: Окно состоит из таблицы импортированных видеороликов. Первым шагом является выбор папки экспорта. Далее определитесь с ассортиментом, вы можете выбрать отрывок или все целиком. Укажите интервал захвата кадра в секундах. Наконец, нажмите кнопку Пуск и управляйте процессом.

source: Importing images
ru: Импорт изображений

source: To get started with images, import the files. There are several options:
ru: Чтобы начать работу с изображениями, импортируйте файлы. Есть несколько вариантов:

source: Drag and drop files to the Image Colors tab
ru: Перетащите файлы на вкладку Цвета изображения

source: Extract color
ru: Извлечение цвета

source: Select the image colors tab
ru: Выберите вкладку цвета изображения

source: After importing the images, select the desired frame in the left navigation bar. The frame will appear in the working window. Choose one of the methods and algorithms for color selection. If you want to exclude black and white colors, then select the desired option. To pin the result under the image, click export or export all.
ru: После импорта изображений выберите нужный кадр на левой панели навигации. Рамка появится в рабочем окне. Выберите один из методов и алгоритмов выделения цвета. Если вы хотите исключить черный и белый цвета, то выберите нужный вариант. Чтобы закрепить результат под изображением, нажмите экспортировать или экспортировать все.

source: Delete
ru: Удалить

source: Disable
ru: Выключить

source: Enable
ru: Включить

source: Grabbing range
ru: Диапазон захвата

source: Import grabbed shots
ru: Импортировать захваченные кадры
